{
    "text": "Safer Industries: Intern Onboarding (and general) Knowledge Base\n\nSection 1: Company Values and Philosophy\n\nPsychological Safety - Every intern should feel safe to contribute, ask questions, and offer feedback.\nDiversity - Safer values accessibility and inclusion in all aspects of the company.\nHuman Flourishing - Interns are encouraged to pursue growth in both professional and personal aspects.\n\nGuiding Principles:\n\nSupport learning journeys: Know what you know, what to learn next, and where to find it.\nEmphasis on reflection and decision points.\nCollaboration-first mindset.\nLearning points, not rules - we support informed, reflective decision-making.\n\nSection 2: Intern Onboarding Process\n\nBefore your internship begins, submit the following to Tim Edwards:\n\n1. Bank Details - Name, Sort Code, Account Number\n\n2. Date of Birth\n\n3. Full Address\n\n4. National Insurance Number\n\n5. Previous employment since 6 April 2025\n\n6. If yes, has that employment ended?\n\n7. P45 form (if available), else: complete Starter Checklist\n\n8. Most recent payslip or known tax code\n\n9. Accessibility requirements or relevant health conditions\n\n10. Proof of Right to Work (Passport photo or Share Code)\n\nIf interns have any questions, the chatbot will answer questions on all the above.\n\nCommunication:\n\nAdd Tim on WhatsApp: +44 7789 110 812\nMessage him to save your number.\nAdd Tim on LinkedIn: Tim Edwards\nYou’ll be asked to provide availability for onboarding meetings (online/in-person). Please ensure you add this based on the dates provided.\n\nSection 3: Tools & Platforms\n\nCommunication: WhatsApp, Google Meet.\n\nDocuments: Google Docs, Sheets, Slides (preferred)\n\n\nSection 4: Safer Industries’ Business Models\n\nCareer development & life coaching\n Mentoring frameworks\nRecruitment consultancy\nWellbeing programs\nDEI & practices\nEvent planning and facilitation\nCulture consulting\nBusiness acceleration for startups\nEducational content creation\nCommunity building\nStartup ecosystem support\nDesign thinking\nOrganisational design\n\nSection 5: Common Issues and Fixes\n\nMissing documents: Recheck onboarding checklist. Still stuck? Ask Tim directly.\n\nWhatsApp not working? Message Tim via email as fallback.\n\nTimesheet confusion? Ask your career’s advisor if unsure, as Tim doesn’t directly handle this. \n\n\nSection 6: Communication\nCommunication Frequency and Timing\nCheck in regularly throughout the day: before starting tasks, after completing milestones, and whenever questions or issues arise.\n\n\nAim for updates every 2-3 hours or upon hitting key milestones, whichever comes first.\n\n\nPreferred Channels\nUse WhatsApp for quick updates and questions.\n\n\nUse email for detailed reports or summaries.\n\n\nCalls are okay if needed, but always follow up with written notes on WhatsApp or email.\n\n\nCommunication Style\nBe clear, direct, and concise — don’t sugarcoat.\n\n\nRespond to all messages and feedback thoroughly; don’t ignore anything, even if it seems minor.\n\n\nState exactly what you think in a constructive way to avoid misunderstandings.\n\n\nMaster Document Management\nCompile all emails, WhatsApp messages, instructions, and notes into one master document.\n\n\nOrganize the document into clear sections such as Communications, Onboarding, Questions, and Not Required.\n\n\nMove irrelevant or low-priority information to a “Not Required” section but keep it accessible.\n\n\nTask and Progress Tracking\nBreak work into clear, achievable milestones with deadlines.\n\n\nTrack progress against these milestones in the master document.\n\n\nProvide updates at each milestone and ask for feedback early and often.\n\n\nPlanning and Review\nShare draft documents early for review and input.\n\n\nUse check-ins at key milestones and whenever clarity is needed to keep things on track.\n\n\nWhy This Matters\nGood communication cuts confusion, speeds progress, and reduces unnecessary back-and-forth.\n\n\nIt builds essential professional skills like clear reporting, feedback integration, and proactive problem-solving.\n\nSection 7: Project Workflow\nCommunication\nFor every project, task, or sub-project: always tell Tim what you’re going to do before doing it.\n\n\nEarly-stage communication is very frequent, detailing every step and progress.\n\n\nOver time, communication frequency will decrease as clarity improves.\n\n\nStay alert and communicate immediately if plans or approaches change.\n\n\nProject Structure\nState your plan before starting.\n\n\nBrainstorm ideas freely — expect some messiness.\n\n\nCreate a clear structure for your work.\n\n\nComplete the first section carefully — enough to avoid redoing later.\n\n\nIdentify key elements to check for correctness; don’t expect everything perfect at once.\n\n\nPresent your work, ask 10-20 critical questions about content, format, and audience.\n\n\nRepeat steps 5-6 with ongoing feedback, which will become less frequent as progress grows.\n\n\nFormatting & Content\nConsider word count, document type (Word, spreadsheet, etc.), and topic relevance.\n\n\nExplain the purpose of your work clearly to Tim and yourself.\n\n\nPurpose\nContinuously update the onboarding document based on feedback and notes.\n\n\nFuture interns will benefit from improved, integrated onboarding materials.\n\n\n\n\n"
}